testPost.php

<?php 
        //Data, connection, auth

        // xml post structure

        $xml_post_string = '<?xml version="1.0" encoding="UTF-8"?> <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:epg="http://epg.generic.booking/"> <soapenv:Header> <epg:AuthHeader> <!--Optional:--> <epg:AccountNo>C175120</epg:AccountNo> <!--Optional:--> <epg:Password>C175120</epg:Password> </epg:AuthHeader> </soapenv:Header> <soapenv:Body> <epg:CreateBookingRequest> <epg:BookingRequest> <epg:SenderContactName>Test</epg:SenderContactName> <epg:SenderCompanyName>tes tes</epg:SenderCompanyName> <epg:SenderAddress>25/1</epg:SenderAddress> <epg:SenderCity>1</epg:SenderCity> <epg:SenderContactMobile>00971503962332</epg:SenderContactMobile> <epg:SenderContactPhone>503962332</epg:SenderContactPhone> <epg:SenderEmail>tes@tes.com</epg:SenderEmail> <epg:SenderZipCode>3371500</epg:SenderZipCode> <epg:SenderState>Dubai</epg:SenderState> <epg:SenderCountry>971</epg:SenderCountry> <epg:ReceiverContactName>tes tes</epg:ReceiverContactName> <epg:ReceiverCompanyName>test tset</epg:ReceiverCompanyName> <epg:ReceiverAddress>Al test 11 Building Flat no. 919 Al Barsha 1 DU</epg:ReceiverAddress> <epg:ReceiverCity>1</epg:ReceiverCity> <epg:ReceiverContactMobile>009710554051946</epg:ReceiverContactMobile> <epg:ReceiverContactPhone>0554051946</epg:ReceiverContactPhone> <epg:ReceiverEmail>vbk1982@gmail.com</epg:ReceiverEmail> <epg:ReceiverZipCode>3371500</epg:ReceiverZipCode> <epg:ReceiverState>Dubai</epg:ReceiverState> <epg:ReceiverCountry>971</epg:ReceiverCountry> <epg:ReferenceNo>14052356239</epg:ReferenceNo> <epg:ReferenceNo1 /> <epg:ReferenceNo2 /> <epg:ReferenceNo3 /> <epg:ContentTypeCode>NonDocument</epg:ContentTypeCode> <epg:NatureType>11</epg:NatureType> <epg:Service>Domestic</epg:Service> <epg:ShipmentType>Express</epg:ShipmentType> <epg:DeleiveryType>Door to Door</epg:DeleiveryType> <epg:Registered>No</epg:Registered> <epg:PaymentType>COD</epg:PaymentType> <epg:CODAmount>66</epg:CODAmount> <epg:CODCurrency>AED</epg:CODCurrency> <epg:CommodityDescription>cosmetics</epg:CommodityDescription> <epg:Pieces>2</epg:Pieces> <epg:Weight>100</epg:Weight> <epg:WeightUnit>Grams</epg:WeightUnit> <epg:Length>20</epg:Length> <epg:Width>5</epg:Width> <epg:Height>20</epg:Height> <epg:DimensionUnit>Centimetre</epg:DimensionUnit> <epg:ItemValue>66</epg:ItemValue> <epg:ValueCurrency>AED</epg:ValueCurrency> <epg:ProductCode /> <epg:SpecialInstructionsID /> <epg:DeliveryInstructionsID /> <epg:LabelType>RPT</epg:LabelType> <epg:RequestSource>api</epg:RequestSource> <epg:isReturnItem>No</epg:isReturnItem> <epg:SendMailToSender>No</epg:SendMailToSender> <epg:SendMailToReceiver>No</epg:SendMailToReceiver> <epg:CustomDeclarations> <!--1 or more repetitions:--> <epg:CustomDeclarationRequest> <epg:HSCode /> <epg:TotalUnits>2</epg:TotalUnits> <epg:Weight>600</epg:Weight> <epg:Value>66</epg:Value> <epg:DeclaredCurrency>AED</epg:DeclaredCurrency> <epg:FileName /> <epg:FileType /> <epg:FileContent /> <!--Optional:--> <epg:CreatedBy /> </epg:CustomDeclarationRequest> </epg:CustomDeclarations> <epg:PreferredPickupDate>25July-2020</epg:PreferredPickupDate> <epg:PreferredPickupTimeFrom>12:00</epg:PreferredPickupTimeFrom> <epg:PreferredPickupTimeTo>17:00</epg:PreferredPickupTimeTo> </epg:BookingRequest>
 </epg:CreateBookingRequest> </soapenv:Body> </soapenv:Envelope>';   // data from the form, e.g. some ID number

sendSOAP($xml_post_string);

?>